



PCE Working Group                                           S. Sivabalan
Internet-Draft                                                 J. Medved
Intended status: Standards Track                     Cisco Systems, Inc.
Expires: April 07, 2014                                         I. Minei
                                                  Juniper Networks, Inc.
                                                                R. Varga
                                               Pantheon Technologies SRO
                                                               E. Crabbe
                                                            Google, Inc.
                                                        October 04, 2013


                   LSP setup method in PCEP messages
                 draft-sivabalan-pce-lsp-setup-type-00.txt

Abstract

   A path computation element can compute traffic engineering paths (TE
   paths) through a network that are subject to various constraints.
   Currently, TE paths are label switched paths (LSPs) which are set up
   using the RSVP-TE signaling protocol.  However, other TE path setup
   methods are possible within the PCE architecture.  This document
   proposes an extension to PCEP to allow support for different LSP
   setup methods over a single PCEP session.

Requirements Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [RFC2119].

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at http://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on April 07, 2014.




Sivabalan, et al.        Expires April 07, 2014                 [Page 1]

Internet-Draft              LSP setup method                October 2013


Copyright Notice

   Copyright (c) 2013 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2
   2.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   3
   3.  LSP Setup Type TLV  . . . . . . . . . . . . . . . . . . . . .   3
   4.  Operation . . . . . . . . . . . . . . . . . . . . . . . . . .   4
   5.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   5
   6.  Normative References  . . . . . . . . . . . . . . . . . . . .   6
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .   6

1.  Introduction

   [RFC5440] describes the Path Computation Element Protocol (PCEP) for
   communication between a Path Computation Client (PCC) and a Path
   Control Element (PCE) or between one a pair of PCEs.  A PCC requests
   from a PCE the computation of a path subject to various constraints
   and optimization criteria.  The PCE responds to the PCC with a hop-
   by-hop path in an ER object.  The PCC uses the ERO object to set up
   the path in the network.

   [I-D.ietf-pce-stateful-pce] specifies extensions to PCEP that allow a
   PCC to delegate its LSPs to the PCE.  The PCE can then update the
   state of LSPs delegated to it.  In particular, the PCE may modify the
   path of an LSP by sending a new ERO.  The PCC uses this ERO to re-
   route the LSP in a make-before-break fashion.
   [I-D.crabbe-pce-pce-initiated-lsp] specifies a mechanism allowing a
   PCE to dynamically instantiate LSPs on a PCC by sending the path and
   characteristics of the LSP.  The PCC signals the LSP using the ERO
   (and other attributes) sent by the PCE.

   So far, the PCEP protocol and its extensions implicitly assume that
   the TE paths are label-switched paths (LSPs), which are established
   via the RSVP-TE protocol.  However, other methods of LSP setup are



Sivabalan, et al.        Expires April 07, 2014                 [Page 2]

Internet-Draft              LSP setup method                October 2013


   not precluded.  Most recently, Segment Routing has emerged as another
   technology for setting up source-routed TE paths.  Other methods for
   setting up TE paths are possible in the future.
   [I-D.sivabalan-pce-segment-routing] specifies the ERO format for LSPs
   set up using SR (SR-ERO).  However, it should be noted that when the
   LSP setup method over a given PCEP session is not the RSVP-TE
   signaling protocol, a new capability MUST be advertised when the PCEP
   session is established.  A given PCEP session can be used to compute,
   initiate, and maintain LSPs which are set up using different setup
   methods.  To facilitate this, the intended LSP setup method needs to
   be indicated in the appropriate PCEP messages, and the path of the
   LSP needs to be encoded in a format that is appropriate for the setup
   type.  This document defines a new TLV called "LSP-SETUP-TYPE TLV"
   for this purpose.

2.  Terminology

   The following terminologies are used in this document:

   ERO:  Explicit Route Object.
   LSR:  Label Switching Router.
   PCC:  Path Computation Client.
   PCE:  Path Computation Element
   PCEP:  Path Computation Element Protocol.
   SR:  Segment Routing.
   SR-ERO:  Segment Routed Explicit Route Object.
   TLV:  Type, Length, and Value.

3.  LSP Setup Type TLV

   A PCC can simultaneously support setting up LSPs using different
   methods.  To enable meaningful interaction with a PCE, the PCE must
   encode the LSP path in a format that is appropriate for the setup
   method used.  To do so, the PCE must be made aware of the setup
   method used by the PCC for a particular LSP.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |             Type              |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     LSP-ST    |                    Reserved                   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

                       Figure 1: LSP-SETUP-TYPE TLV

   LSP-SETUP-TYPE TLV is an optional TLV for use in the RP ([RFC5440])
   and SRP ([I-D.ietf-pce-stateful-pce]) objects.  Its format is shown



Sivabalan, et al.        Expires April 07, 2014                 [Page 3]

Internet-Draft              LSP setup method                October 2013


   in the above figure.  The type of the TLV is to be defined by IANA.
   The one octet value contains the LSP Setup Type (LSP-ST).  This
   document specifies the following LSP-ST values:

   o  ST = 0: LSP is setup via RSVP-TE signaling protocol(default).
   o  ST = 1: LSP is setup via Segment Routing.

   In the absence of this TLV, RSVP-TE is assumed as the setup method.
   If an RP or SRP object contains more than one LSP-SETUP-TYPE TLV,
   only the first TLV MUST be processed and the rest MUST be ignored.

4.  Operation

   When requesting the computation of a path from a PCE using a PCReq
   message ([RFC5440]), a PCC MAY include the LSP-SETUP-TYPE TLV in the
   RP object.  If the PCE is capable of expressing the LSP path in a
   format appropriate for the setup method used, it MUST use the
   appropriate ERO format in the PCRep message.  If the PCE does not
   support the intended LSP establishment type, but it does recognize
   the LSP-SETUP-TYPE TLV, it MUST send PCErr with Error-Type = TBD (LSP
   setup error) (recommended value is 19) and Error-Value = 1
   (Unsupported LSP setup type,) and close the PCEP session.  If an LSP
   setup type specified in PCRep message does not match that of the
   PCReq message, the PCC MUST send a PCErr with Error-Type = 19 (LSP
   setup error) and Error-Value = 2 (Mismatched LSP setup type) and
   close the PCEP session.

   In the case of stateful PCE, a PCC MUST report the setup type of all
   LSPs in PCRpt messages both in the synchronization phase and in
   subsequent updates.  The absence of the LSP-SETUP-TYPE TLV is
   equivalent to an LSP_SETUP-TYPE TLV with an LSP-ST value of 0 (RSVP-
   TE), and it is recommended to omit including it when this is the
   case.  If the LSP-SETUP-TYPE TLV needs to be included, the SRP object
   MUST be present even in cases when the SRP-ID-number is the reserved
   value of 0x00000000.  A PCRpt message whose SRP-ID-number is not
   equal to 0x00000000 MUST match the path-type of the PCUpd message
   that triggered its generation.  Otherwise, the PCE MUST send PCErr
   with Error-Type = 19 (LSP setup error) and Error-Value = 2
   (Mismatched LSP setup type) and close the connection.

   In the case of PCE initiated LSPs, if a PCC does not support the
   path-type specified in PCInitiate message, the PCC MUST send PCErr
   with Error-Type = 19 (LSP setup error) and Error-Value = 1
   (Unsupported LSP setup type) and close the PCEP session.  The path-
   type in PCRpt messages generated as a result of a PCUpd or PCInitiate
   message MUST match the path-type of the message that triggered it.
   Otherwise, the PCE MUST send PCErr with Error-Type = 19 (LSP setup
   error) and Error-Value = 2 (Mismatched LSP setup type).  For LSPs



Sivabalan, et al.        Expires April 07, 2014                 [Page 4]

Internet-Draft              LSP setup method                October 2013


   that are not setup up using RSVP-TE signaling protocol, the path-type
   MUST be included in the SRP object, and the SRP object MUST be
   included even if the SRP-ID-number is the reserved value of
   0x00000000.

   If a PCEP speaker does not support LSP-SETUP-TYPE TLV, it MUST send
   PCErr with Error-Type = 3 (Unknown Object) and Error-Value = 3
   (Unsupported TLV).

5.  IANA Considerations

   IANA is requested to allocate a new TLV type (recommended value is
   TBD)for LSP-SETUP-TYPE TLV specified in this document.

   This document requests that a registry is created to manage the value
   of the LSP Setup Type field in the LSP-SETUP-TYPE TLV.

      Value Description                                Reference

        0   LSP is setup using RSVP signaling protocol This document
        1   LSP is Segment Routed                      This document

                                  Table 1

   This document also defines a new Error-Type (recommended 19) and new
   Error-Values for the following new error conditions:


    Error-Type  Meaning
       19       Invalid LSP setup type

                 Error-value=1:  Unsupported LSP setup type
                 Error-value=2:  Mismatched LSP setup type

   This document also defines a new Error-Value for the existing Error-
   Type 3 (Unknown Object):


    Error-Type  Meaning
       3        Unknown Object

                 Error-value=3:  Unsupported TLV









Sivabalan, et al.        Expires April 07, 2014                 [Page 5]

Internet-Draft              LSP setup method                October 2013


6.  Normative References

   [I-D.crabbe-pce-pce-initiated-lsp]
              Crabbe, E., Minei, I., Sivabalan, S., and R. Varga, "PCEP
              Extensions for PCE-initiated LSP Setup in a Stateful PCE
              Model", draft-crabbe-pce-pce-initiated-lsp-02 (work in
              progress), July 2013.

   [I-D.ietf-pce-stateful-pce]
              Crabbe, E., Medved, J., Minei, I., and R. Varga, "PCEP
              Extensions for Stateful PCE", draft-ietf-pce-stateful-
              pce-06 (work in progress), August 2013.

   [I-D.sivabalan-pce-segment-routing]
              Sivabalan, S., Medved, J., Filsfils, C., Crabbe, E., and
              R. Raszuk, "PCEP Extensions for Segment Routing", draft-
              sivabalan-pce-segment-routing-01 (work in progress), July
              2013.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC5440]  Vasseur, JP. and JL. Le Roux, "Path Computation Element
              (PCE) Communication Protocol (PCEP)", RFC 5440, March
              2009.

Authors' Addresses

   Siva Sivabalan
   Cisco Systems, Inc.
   2000 Innovation Drive
   Kanata, Ontario  K2K 3E8
   Canada

   Email: msiva@cisco.com


   Jan Medved
   Cisco Systems, Inc.
   170 West Tasman Dr.
   San Jose, CA  95134
   USA

   Email: jmedved@cisco.com







Sivabalan, et al.        Expires April 07, 2014                 [Page 6]

Internet-Draft              LSP setup method                October 2013


   Ina Minei
   Juniper Networks, Inc.
   1194 N. Mathilda Ave.
   Sunnyvale, CA  94089
   USA

   Email: ina@juniper.net


   Robert Varga
   Pantheon Technologies SRO
   Mlynske Nivy 56
   Bratislava, 821 05
   Slovakia

   Email: robert.vargad@pantheon.sk


   Edward Crabbe
   Google, Inc.
   1600 Amphitheatre Parkway
   Mountain View, CA  94043
   USA

   Email: edc@google.com


























Sivabalan, et al.        Expires April 07, 2014                 [Page 7]
